import java.text.Format;
import java.util.*;

public class JavaUtilLearn {
    public static void main(String[] args) {
        Formatter fmt = new Formatter();
        fmt.format("Привет %s, у тебя это получится с %d попытки. %f", "Mardon", 1,2.56);
        System.out.println(fmt);
        System.out.println("Привет %s".formatted("Мардон"));
        System.out.printf("Привет %s%n", "Mardon");
        fmt.close();
    }
}

//
/*
BitSet - массив битовых значений в виде булевых величин
Date - старый класс для дат и тд (лучше использовать Calendar)
Locale - описывает географический или культурный регион
Random - ГСЧ RNG
Currency - инкапсулирует информацию о валюте, не имеет конструктора

Optional, OptionalDouЬle, Optionalint и OptionalLong - классы основанные на значениях, для null защиты.
Optional<T> - T это тип хранимого значения, может быть пустым. Без конструктора.
.isPresent() - есть ли значение
.get() - получить значение (либо NoSuchElementException)
.orElse(запасноеЗначение) - вернёт значение или запаску

нет конструкторов, надо использовать метод of или .empty(): Optional<Test> ot = Optional.of(new Test());
числовые виды работают также и имеют разные методы по типу getAsDouble()

Calendar - абстрактный класс для преобразования времени
.getInstance - возвращает объект Calendar для стандартной локали и часового пояса
int get(int calendarField) - возвращает значения компонента календаря (Calendar.YEAR, Calendar.МОNТН,
Calendar.MINUTE, ...)

        String[] months = {"Jan", "Feb", "Mar", "Apr", "Мау", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov",
        "Dec"};

        Calendar calendar = Calendar.getInstance();
        System.out.print("Дата: ");
        System.out.print(months[calendar.get(Calendar.MONTH)]);
        System.out.println(" "+calendar.get(Calendar.YEAR));

        System.out.println("Время: "+calendar.get(Calendar.HOUR)+":"+calendar.get(Calendar.MINUTE)+":"+
                calendar.get(Calendar.SECOND));

        calendar.set(Calendar.HOUR, 10);
        System.out.println(calendar.get(Calendar.HOUR));


GregorianCalendar - дэфолт календарь. С конструктором можно изменить дату, время, локаль, часовой пояс
.isLeapYear() - високосный ли год


TimeZone - абстрактный класс для работы со смещением часового пояса относительно среднего времени по
Гринвичу (Greenwich mean time - GMT), который также называется универсальным скоординированным временем
(Coordinated Universal Time - UTC). Также вычисляет летнее время


Simple TimeZone - позволяет работать с григорианским календарём и вычислять летнее время
SimpleTimeZone (int timeDelta, String tzName) - timeDelta: смещение по GMT


Timer, TimerTask - позволяет создать поток работающий в фоновом режиме и ожидающий определённое время. Когда
наступает момент, выполняется задача. Можно планировать повторное выполнение задачи и её запуск в определённую
дату. Эти классы работаю вместе
Timer - планирование выполнения задачи. Запланированная задача это объект TimerTask
.schedule() - настройка повторений и времени выполнений задач
        TimerTask tt = new TimerTask() {
            @Override
            public void run() {
                System.out.println("Выполняется задача таймера");
            }
        };
        Timer t = new Timer();
        t.schedule(tt, 1000, 500); // начальная задержка 1 секунда и повторять каждые полсекунды
        try {
            Thread.sleep(5000);
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
        t.cancel(); // прекратить работу таймера


Formatter - создание форматированного вывода. Сохраняет форматированный текст в буфере и может в любой момент его
вернуть. Можно предоставить собственный буфер и направить буфер в файл. Некоторые форматы можно указывать заглавной
и маленькой буквой. Заглавная - отображает буквы заглавными, где это возможно
%a - шестандатиричное число с плавающей точкой (Ox1.sigpexp) Ox1.Op9 это 512.0
%b - булевое значение
%c - символ
%d - decimal
%h - хэш-код аргумента
%e - экспоненциальная форма записи (x.dddddde+/-yy) 1.4352+e11
%f - float
%g - я хз лол
%o - octal
%n - newLine (не имеет аргумента)
%s - string
%t - время и дата, использует суффиксы, аргумент должен иметь тип Calendar, Date, Long, long или TemporalAccessor.
%x - hex
%% - символ процента (не имеет аргумента)

после форматирования можно получить строку .toString()
.close() - не забывать всегда в конце закрывать форматтер
.out() - ссылка на внутренний выходной буфер

целое число между % и кодом - минимальная ширина поля, дополняется пробелами. 0 перед числом - заполнить нулями
указатель точности - применяется к %f, %е, %g и %s, после МШП после точки: %12.5f

флаги формата - управляет преобразованием. Следуют после символа %
-   -выравнивание по левому краю
# - alt формат преобразования для %о(ведущий ноль), %х (отображает 0x), %е и %f (гарантирует десятичную точку)
0 - выводимые данные дополняются нулями а не пробелами
пробел - положительные числа выводятся с предшествующим пробелом
+ - положительные числа выводятся с предшествующим знаком +
, - числа содержат разделители групп (при отображении крупных чисел: 1,323,453,987)
( - отрицательные числа в круглых скобках

индекс аргумента - какой аргумент по счёту будет использоваться для форматирования: %3$d - третий аргумент
Позволяют повторно использовать один и тот же аргумент

printf - альтернатива


Scanner - читает лексемы из источника. Лексема - порция входных данных, ограниченная разделителями (дэфолт: пробел)
next() - возвращает лексему
next(Pattern pattern) - возвращает лексему по паттерну
hasNext() - возвращает true если имеется лексема нужного типа
nextDouble() - может читать и обычные интовые числа

При закрытии сканнера, объект который он использует тоже закрывается

Разделители можно изменить .useDelimiter(): e.g. ", *" - запятая и >=0 пробелов
.delimiter() - получить текущий шаблон разделителей
.findInLine(pattern) - ищет и возвращает лексему после шаблона или null
.findWithinHorizon(pattern, count) - ищет среди count символов (по всем если count = 0)


HexFormat - класс значений, используется для hex

*/














