public class JavaNIOLearn {
    public static void main(String[] args) {

    }
}

/*
New I/O построена на буферах и каналах. Буфер хранит данные, канал - открытое подключение. Для использования NIO
нужно получить канал к устройству ввода/вывода и буффер для хранения данных. Затем работать с буфером и выполнять
ввод/вывод данных.


Классы буферов в пакете java.nio, все они подклассы Buffer, который определяет основной функционал:
Текущая позиция - индекс в буфере, в котором будет выполняться следующая операция чтения и записи. Она перемещается
после выполнения большинства i/o операций.
Предел - индекс последнего допустимого местоположения в буфере
Ёмкость - кол-во элементов, которые хранит буфер. Часто равен пределу
Все буферы предоставляют разные методы get() и put()


Каналы - в пакете java.nio.channels, это открытое подключение с источником или адресатом i/o. Реализуют интерфейс
Channel. Для получения канала вызывается метод .getChannel() на объекте, поддерживающем каналы. Тип канал зависит
от типа объекта. E.g. файловые классы вернуть FileChannel. Поддерживает разные виды read() и write()


В NIO также есть наборы символов и селекторы:
Набор символов - способ сопоставления байтов с символами.
Селектор - неблокирующий многоканальный io на основе ключей. Позволяют выполнить i/o по нескольким каналам
Интерфейс Path - инкапсулирует путь к файлу. Создаётся с помощью Path.of()


Files - действия с файлом через статические методы этого класса. Файл с которым работаем это объект Path.
Можно выполнить большинство дэфолт действий с файлом (перемещение, создание, просмотр свойств, удаление, ...)

Некоторые методы могут принимать объекты интерфейса OpenOption, описывает каким образом открыть файл, реализует
перечисления StandartOpenOption: APPEND, CREATE, DELETE_ON_CLOSE, READ, ... .


           ~~~~~~~~~~~ Использование системы NIO для ввода-вывода, основанного на каналах ~~~~~~~~~~~
Чтение файла через канал имеет много способов:
1. Выделение памяти под буфер вручную -> чтение -> загрузить буфер данными из файла
SeekableByteChannel - инкапсуляция канала для файловых операций, интерфейс. Реализуется FileChannel
ByteBuffer.allocate(int cap) - инициализировать буфер с размером cap
с887
*/